; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v2 - type_2 ?v5 - type_3)
 	      (pred_4 ?v4 - object ?v5 - type_3)
	      (pred_3 ?v2 - type_2 ?v8 - type_1)
	      (pred_1 ?v2 - type_2 ?v4 - object ?v8 - type_1))

   (:action op_2
       :parameters  (?v2 - type_2 ?v3 ?v1 - type_3)
       :precondition (and  (pred_2 ?v2 ?v3))
       :effect (and  (pred_2 ?v2 ?v1)
		     (not (pred_2 ?v2 ?v3))))

   (:action op_1
       :parameters (?v2 - type_2 ?v6 - object ?v7 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v7) (pred_2 ?v2 ?v7) (pred_3 ?v2 ?v8))
       :effect (and (pred_1 ?v2 ?v6 ?v8)
		    (not (pred_4 ?v6 ?v7)) 
		    (not (pred_3 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_2 ?v6 - object ?v7 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v6 ?v8) (pred_2 ?v2 ?v7))
       :effect (and (pred_4 ?v6 ?v7)
		    (pred_3 ?v2 ?v8)
		    (not (pred_1 ?v2 ?v6 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_09 - type_2
obj_10 obj_08 - type_1
obj_07 obj_05 obj_01 obj_02 - type_3
obj_06 obj_03 obj_04 - object)
(:init
(pred_2 obj_09 obj_05)
(pred_3 obj_09 obj_10)
(pred_3 obj_09 obj_08)
(pred_4 obj_06 obj_02)
(pred_4 obj_03 obj_02)
(pred_4 obj_04 obj_05)
)
(:goal
(and
(pred_4 obj_06 obj_02)
(pred_4 obj_03 obj_05)
(pred_4 obj_04 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_09 ?b obj_08))))
)
)

; plan
1. (op_1 obj_09 obj_04 obj_05 obj_10)
   deleted: (pred_4 obj_04 obj_05) (pred_3 obj_09 obj_10)
   added: (pred_1 obj_09 obj_04 obj_10)
   goals met: 1 of 3
2. (op_2 obj_09 obj_05 obj_07)
   deleted: (pred_2 obj_09 obj_05)
   added: (pred_2 obj_09 obj_07)
   goals met: 1 of 3
3. (op_3 obj_09 obj_04 obj_07 obj_10)
   deleted: (pred_1 obj_09 obj_04 obj_10)
   added: (pred_4 obj_04 obj_07) (pred_3 obj_09 obj_10)
   goals met: 2 of 3
4. (op_2 obj_09 obj_07 obj_02)
   deleted: (pred_2 obj_09 obj_07)
   added: (pred_2 obj_09 obj_02)
   goals met: 2 of 3
5. (op_1 obj_09 obj_03 obj_02 obj_10)
   deleted: (pred_4 obj_03 obj_02) (pred_3 obj_09 obj_10)
   added: (pred_1 obj_09 obj_03 obj_10)
   goals met: 2 of 3
6. (op_2 obj_09 obj_02 obj_05)
   deleted: (pred_2 obj_09 obj_02)
   added: (pred_2 obj_09 obj_05)
   goals met: 2 of 3
7. (op_3 obj_09 obj_03 obj_05 obj_10)
   deleted: (pred_1 obj_09 obj_03 obj_10)
   added: (pred_4 obj_03 obj_05) (pred_3 obj_09 obj_10)
   goals met: 3 of 3
